In [1]:
import pandas as pd
import numpy as np

s = pd.Series([1,2,4,123])
s

0      1
1      2
2      4
3    123
dtype: int64

In [2]:
datalist = np.array([2,12,223,3])
print('len= '+str(len(datalist)))
s = pd.Series(datalist)
s
print('s[2]='+str(s[2]))
print(s[1])

len= 4
s[2]=223
12

In [3]:
p = pd.Series(datalist,index = [100,101,102,105])
p

100      2
101     12
102    223
105      3
dtype: int32

In [4]:
data2 = 5
da2 = pd.Series(data2, index = [1, 3, 4])
da2

1    5
3    5
4    5
dtype: int64

In [5]:
data1 = {'a':2,'b':44,'c':2,'3':88}
dal = pd.Series(data1, index = ['a','3','d','c'])
print(dal['3'])
print(dal[:4])
dal

88.0
a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

## DataFrame

In [6]:
f1 = pd.DataFrame()
print(f1)
f1

Empty DataFrame
Columns: []
Index: []

Empty DataFrame
Columns: []
Index: []

In [7]:
list1 = [1,23,33,4,3]
f2 = pd.DataFrame(list1)
f2

    0
0   1
1  23
2  33
3   4
4   3

In [8]:
print(f2)

    0
0   1
1  23
2  33
3   4
4   3

In [9]:
list3 = [["liu",2],['sun',8],['bule','jun']]
f3 = pd.DataFrame(list3)
f3

      0    1
0   liu    2
1   sun    8
2  bule  jun

## 字典

In [10]:
list4 = [{'liu':'kk','jun':'as'},{'liu':'bb','jun':'ss','hell':'kk9'}]
list4

[{'liu': 'kk', 'jun': 'as'}, {'liu': 'bb', 'jun': 'ss', 'hell': 'kk9'}]

In [11]:
f5 = pd.DataFrame(list4)
f5

  hell jun liu
0  NaN  as  kk
1  kk9  ss  bb

In [12]:
f6 = pd.DataFrame(list4,index = ['fies','sec'])
f6['jun']

fies    as
sec     ss
Name: jun, dtype: object

In [13]:
f7 = pd.DataFrame(list4, index = ['no1','no2'], columns = ['liu', 'jun'])
f7

    liu jun
no1  kk  as
no2  bb  ss

# 字典的系列可以传递以形成一个DataFrame。 所得到的索引是通过的所有系列索引的并集。

In [14]:
list18 = {'one':pd.Series([1,3,2,],index=['ll','kk','jj']), 'two':pd.Series([33,23,22],index=['ll','kk','bb'])}
f8 = pd.DataFrame(list18)
f8

    one   two
bb  NaN  22.0
jj  2.0   NaN
kk  3.0  23.0
ll  1.0  33.0

# 列选择

In [15]:
f8['one']

bb    NaN
jj    2.0
kk    3.0
ll    1.0
Name: one, dtype: float64

In [16]:
f8['one'].tolist()

[nan, 2.0, 3.0, 1.0]

## 列添加

In [17]:
f8['three'] = pd.Series(['99','990','88'],index = ['ll','kk','bb'])
f8

    one   two three
bb  NaN  22.0    88
jj  2.0   NaN   NaN
kk  3.0  23.0   990
ll  1.0  33.0    99

# 列删除

In [18]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
unsorted_df

       col2      col1
1  0.782059 -0.285503
4  1.086841 -0.008306
6  0.456163 -0.249985
2 -0.836528 -0.657820
3  0.095881 -0.338379
5 -0.216457  0.045848
9  0.020771  1.262417
8 -0.296818  0.816156
0  0.426029  1.363165
7  0.772282 -0.193286

In [19]:
sort_df = unsorted_df.sort_index()
sort_df

       col2      col1
0  0.426029  1.363165
1  0.782059 -0.285503
2 -0.836528 -0.657820
3  0.095881 -0.338379
4  1.086841 -0.008306
5 -0.216457  0.045848
6  0.456163 -0.249985
7  0.772282 -0.193286
8 -0.296818  0.816156
9  0.020771  1.262417

In [20]:
sort_udf = unsorted_df.sort_index (ascending = False)
sort_udf

       col2      col1
9  0.020771  1.262417
8 -0.296818  0.816156
7  0.772282 -0.193286
6  0.456163 -0.249985
5 -0.216457  0.045848
4  1.086841 -0.008306
3  0.095881 -0.338379
2 -0.836528 -0.657820
1  0.782059 -0.285503
0  0.426029  1.363165

In [21]:
kk = unsorted_df.sort_index(axis = 1)
kk

       col1      col2
1 -0.285503  0.782059
4 -0.008306  1.086841
6 -0.249985  0.456163
2 -0.657820 -0.836528
3 -0.338379  0.095881
5  0.045848 -0.216457
9  1.262417  0.020771
8  0.816156 -0.296818
0  1.363165  0.426029
7 -0.193286  0.772282

In [22]:
kk1 = kk.sort_values(by = 'col1')
kk1

       col1      col2
2 -0.657820 -0.836528
3 -0.338379  0.095881
1 -0.285503  0.782059
6 -0.249985  0.456163
7 -0.193286  0.772282
4 -0.008306  1.086841
5  0.045848 -0.216457
8  0.816156 -0.296818
9  1.262417  0.020771
0  1.363165  0.426029

In [23]:
kk2 = kk.sort_values(by = ['col1','col2'])
kk2

       col1      col2
2 -0.657820 -0.836528
3 -0.338379  0.095881
1 -0.285503  0.782059
6 -0.249985  0.456163
7 -0.193286  0.772282
4 -0.008306  1.086841
5  0.045848 -0.216457
8  0.816156 -0.296818
9  1.262417  0.020771
0  1.363165  0.426029

In [24]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],          
        'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
kk3 = pd.DataFrame(ipl_data)
kk3

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [25]:
kk3.groupby('Team')

In [26]:
kk4 =kk3.groupby('Team').groups
kk4

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [27]:
kk5 = kk3.groupby(['Team','Year']).groups
kk5

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

# format

In [28]:
print('{},{}'.format('liu','jun'))

liu,jun

In [29]:
print('{0}{1}'.format('liu','jun'))

liujun

In [30]:
print('{1},{0},{1}'.format('liu','jun'))

jun,liu,jun

In [31]:
print('{name},{age}'.format(name='liu',age=18))

liu,18

In [32]:
list1=['ni','hao','21']
ss = 'wold ssi {}'.format(list1)
ss

"wold ssi ['ni', 'hao', '21']"

In [33]:
b_dict={"name":'liu', "sex":'nan'}
kk = 'wold shift {name},sex is {sex}'.format(**b_dict)
kk

'wold shift liu,sex is nan'

In [34]:
listkk= ['12',"nin",'hao']
s1 = ','.join(listkk)
s1

'12,nin,hao'

In [35]:
s2 = ','.join("'"+x+"'" for x in listkk)
s2

"'12','nin','hao'"

In [36]:
from numpy import nan as NaN
df1=pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [37]:
df1.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  2.0
2  0.0  0.0  0.0
3  8.0  8.0  0.0

In [38]:
import numpy as np
df=pd.DataFrame(np.arange(16).reshape((4,4)),index=list(range(4)),columns=['a','b','c','d'])

In [39]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
df.loc[1:3,['b','c']]

    b   c
1   5   6
2   9  10
3  13  14

In [41]:
df['b']

0     1
1     5
2     9
3    13
Name: b, dtype: int32

In [42]:
df[0:2]

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [43]:
df.loc[df.loc[:,'a']>1]

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [44]:
df.d

0     3
1     7
2    11
3    15
Name: d, dtype: int32

In [45]:
size_list = ['a','b','c','d']

for i in size_list:
    print(df.loc[df[i],i])

0     0.0
4     NaN
8     NaN
12    NaN
Name: a, dtype: float64
1     5.0
5     NaN
9     NaN
13    NaN
Name: b, dtype: float64
2     10.0
6      NaN
10     NaN
14     NaN
Name: c, dtype: float64
3     15.0
7      NaN
11     NaN
15     NaN
Name: d, dtype: float64

C:\Users\liuju\AppData\Local\Continuum\anaconda3\envs\python3.6\lib\site-packages\pandas\core\indexing.py:1017: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

In [46]:
for i in size_list:
    df.loc[df[i]<3,i] =0
    df.loc[df[i]>5,i] =1
df

   a  b  c  d
0  0  0  0  3
1  4  5  1  1
2  1  1  1  1
3  1  1  1  1

In [47]:
fs11 = pd.DataFrame([[21, 1.0,3.0,1],
                   [31, 4.0,5.0,2],
                   [21, 4.0,5.0,-3],
                   [5, 0.0,6.0,4]],

columns = list('ABCD'))
fs11

    A    B    C  D
0  21  1.0  3.0  1
1  31  4.0  5.0  2
2  21  4.0  5.0 -3
3   5  0.0  6.0  4

In [48]:
fs11.cumsum(axis=1)

      A     B     C     D
0  21.0  22.0  25.0  26.0
1  31.0  35.0  40.0  42.0
2  21.0  25.0  30.0  27.0
3   5.0   5.0  11.0  15.0

In [49]:
fs11['max'] = fs11['A']+fs11['B']
fs11

    A    B    C  D   max
0  21  1.0  3.0  1  22.0
1  31  4.0  5.0  2  35.0
2  21  4.0  5.0 -3  25.0
3   5  0.0  6.0  4   5.0

In [50]:

fs11['sum'] = fs11['D'].cumsum()
fs11

    A    B    C  D   max  sum
0  21  1.0  3.0  1  22.0    1
1  31  4.0  5.0  2  35.0    3
2  21  4.0  5.0 -3  25.0    0
3   5  0.0  6.0  4   5.0    4

In [51]:
import numpy as np

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','z'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a  0.871603 -0.749777 -2.220135  0.873028
b  1.167987  1.101578 -1.319402 -0.446742
c  0.498045  1.783364  0.310299  3.780791
d -2.432695 -1.063328  0.334875 -0.290180
e  0.559166  0.642187 -0.106787  0.641710
f  0.938751  0.311568 -0.271225 -0.033653
g -0.056587  0.542339 -0.906059 -0.779558
z  1.136756  0.594717 -0.755441  3.213434

In [52]:
df['A']

a    0.871603
b    1.167987
c    0.498045
d   -2.432695
e    0.559166
f    0.938751
g   -0.056587
z    1.136756
Name: A, dtype: float64

In [53]:
df.loc[:,['A','D']]

          A         D
a  0.871603  0.873028
b  1.167987 -0.446742
c  0.498045  3.780791
d -2.432695 -0.290180
e  0.559166  0.641710
f  0.938751 -0.033653
g -0.056587 -0.779558
z  1.136756  3.213434

In [54]:
df.loc[df['D']<0, 'D'] = 0
df

          A         B         C         D
a  0.871603 -0.749777 -2.220135  0.873028
b  1.167987  1.101578 -1.319402  0.000000
c  0.498045  1.783364  0.310299  3.780791
d -2.432695 -1.063328  0.334875  0.000000
e  0.559166  0.642187 -0.106787  0.641710
f  0.938751  0.311568 -0.271225  0.000000
g -0.056587  0.542339 -0.906059  0.000000
z  1.136756  0.594717 -0.755441  3.213434

In [55]:
df.loc[['a','e'],['A','D']]

          A         D
a  0.871603  0.873028
e  0.559166  0.641710

In [56]:
df.loc['a':'e',['A','D']]

          A         D
a  0.871603  0.873028
b  1.167987  0.000000
c  0.498045  3.780791
d -2.432695  0.000000
e  0.559166  0.641710

In [57]:
df.loc['a':'e']

          A         B         C         D
a  0.871603 -0.749777 -2.220135  0.873028
b  1.167987  1.101578 -1.319402  0.000000
c  0.498045  1.783364  0.310299  3.780791
d -2.432695 -1.063328  0.334875  0.000000
e  0.559166  0.642187 -0.106787  0.641710

# loc 两个是参数，前面一个是判断条件，缺失的时候，考虑那个是默认的. 第一个参数是行或者判断条件，第一个参数是列，缺失的情况下 默认是所有

In [58]:
df.loc['a']

A    0.871603
B   -0.749777
C   -2.220135
D    0.873028
Name: a, dtype: float64

In [59]:
df.loc[:,'A']

a    0.871603
b    1.167987
c    0.498045
d   -2.432695
e    0.559166
f    0.938751
g   -0.056587
z    1.136756
Name: A, dtype: float64

# 第一个参数是条件：列A 所有大于0的数，第二个参数是对应的列

In [60]:
df.loc[df['A']>0,'A']=0

In [61]:
df

          A         B         C         D
a  0.000000 -0.749777 -2.220135  0.873028
b  0.000000  1.101578 -1.319402  0.000000
c  0.000000  1.783364  0.310299  3.780791
d -2.432695 -1.063328  0.334875  0.000000
e  0.000000  0.642187 -0.106787  0.641710
f  0.000000  0.311568 -0.271225  0.000000
g -0.056587  0.542339 -0.906059  0.000000
z  0.000000  0.594717 -0.755441  3.213434

In [62]:
df['sumCD'] = df['C']+df['D']
df

          A         B         C         D     sumCD
a  0.000000 -0.749777 -2.220135  0.873028 -1.347107
b  0.000000  1.101578 -1.319402  0.000000 -1.319402
c  0.000000  1.783364  0.310299  3.780791  4.091090
d -2.432695 -1.063328  0.334875  0.000000  0.334875
e  0.000000  0.642187 -0.106787  0.641710  0.534923
f  0.000000  0.311568 -0.271225  0.000000 -0.271225
g -0.056587  0.542339 -0.906059  0.000000 -0.906059
z  0.000000  0.594717 -0.755441  3.213434  2.457994

In [63]:
df['test'] = df['A'].sum()
df

          A         B         C         D     sumCD      test
a  0.000000 -0.749777 -2.220135  0.873028 -1.347107 -2.489282
b  0.000000  1.101578 -1.319402  0.000000 -1.319402 -2.489282
c  0.000000  1.783364  0.310299  3.780791  4.091090 -2.489282
d -2.432695 -1.063328  0.334875  0.000000  0.334875 -2.489282
e  0.000000  0.642187 -0.106787  0.641710  0.534923 -2.489282
f  0.000000  0.311568 -0.271225  0.000000 -0.271225 -2.489282
g -0.056587  0.542339 -0.906059  0.000000 -0.906059 -2.489282
z  0.000000  0.594717 -0.755441  3.213434  2.457994 -2.489282

In [64]:
sale_data = {'prod_id': ['1101', '1101', '1107', '1107', '11071',
         '1102', '11022', '2200', '3300', '999', '44', '66'],
         'size_id': [12, 12, 233, 233, 21,888 ,888,144,277 , 477,177,2888],
         'Year': [2014-1,2015-3,2014-3,2015-9,2014-1,2015,2016,2017,2016,2014,2015,2017],          
        'qty':[8,79,863,73,1,0,756,0,64,7,8,6]}
sale_data = pd.DataFrame(sale_data)

In [65]:
sale_data

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
4    11071       21  2013    1
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [66]:
sale_data.set_index(['prod_id','size_id'],inplace = True)

In [67]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [68]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [69]:
sale_data_1 = sale_data['qty'].sum(level = ['prod_id','size_id']).reset_index().rename(columns = {'qty':'sumaa'})
sale_data_1

lll = sale_data_1.set_index(['prod_id','size_id']).reset_index(['prod_id','size_id'])

In [70]:
sale_data_1

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [71]:
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [72]:
lll.reset_index()
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [73]:
sale_data['Year']

prod_id  size_id
1101     12         2013
         12         2012
1107     233        2011
         233        2006
11071    21         2013
1102     888        2015
11022    888        2016
2200     144        2017
3300     277        2016
999      477        2014
44       177        2015
66       2888       2017
Name: Year, dtype: int64

In [74]:
pd.to_datetime(sale_data['Year'])

prod_id  size_id
1101     12        1970-01-01 00:00:00.000002013
         12        1970-01-01 00:00:00.000002012
1107     233       1970-01-01 00:00:00.000002011
         233       1970-01-01 00:00:00.000002006
11071    21        1970-01-01 00:00:00.000002013
1102     888       1970-01-01 00:00:00.000002015
11022    888       1970-01-01 00:00:00.000002016
2200     144       1970-01-01 00:00:00.000002017
3300     277       1970-01-01 00:00:00.000002016
999      477       1970-01-01 00:00:00.000002014
44       177       1970-01-01 00:00:00.000002015
66       2888      1970-01-01 00:00:00.000002017
Name: Year, dtype: datetime64[ns]

In [75]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [76]:
salemax = sale_data.groupby(['prod_id','size_id'])
salemax['qty'].max().reset_index().rename(columns={'qty':'max'})

  prod_id  size_id  max
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [77]:
col_group = ['prod_id','size_id']
salemax = sale_data.groupby(col_group)['qty'].max().reset_index()

In [78]:
salemax

  prod_id  size_id  qty
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [79]:
salemax.set_index(['prod_id','size_id'],inplace= True)
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [80]:
salemax.loc[salemax['qty']>0].index

MultiIndex(levels=[['1101', '1102', '11022', '1107', '11071', '2200', '3300', '44', '66', '999'], [12, 21, 144, 177, 233, 277, 477, 888, 2888]],
           codes=[[0, 2, 3, 4, 6, 7, 8, 9], [0, 7, 4, 1, 5, 3, 8, 6]],
           names=['prod_id', 'size_id'])

In [81]:
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [82]:
qq = salemax.reset_index().groupby(['prod_id','size_id']).count()
qq.columns = ['count']
qq

                 count
prod_id size_id
1101    12           1
1102    888          1
11022   888          1
1107    233          1
11071   21           1
2200    144          1
3300    277          1
44      177          1
66      2888         1
999     477          1

# sort_index()

In [83]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),columns=['c','a','b'],index=['D','B','C','A'])

In [84]:
frame

   c   a   b
D  0   1   2
B  3   4   5
C  6   7   8
A  9  10  11

In [85]:
frame.sort_index(inplace =True)

In [86]:
frame

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [87]:
frame_copy = frame.copy()

In [88]:
frame_copy

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [89]:
frame_copy['col'] = 1
frame_copy.set_index('col', inplace= True)
frame_copy

     c   a   b
col
1    9  10  11
1    3   4   5
1    6   7   8
1    0   1   2

# append

In [90]:
df1 = pd.DataFrame([[1, 2,7,7], [3, 4,8,8]], columns=list('ABCD'))
df1['is'] = 0
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2['is'] =1

In [91]:
df1

   A  B  C  D  is
0  1  2  7  7   0
1  3  4  8  8   0

In [92]:
df2

   A  B  is
0  5  6   1
1  7  8   1

In [93]:
org = df1.append(df2, sort = False)

org

In [94]:
org['col'] =1

In [95]:
org

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  NaN   1    1
1  7  8  NaN  NaN   1    1

In [96]:
org.fillna({'D':0})

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  0.0   1    1
1  7  8  NaN  0.0   1    1

In [97]:
week_no = pd.DataFrame(list(range(-4,0)),columns = ['week_no'])
week_no

   week_no
0       -4
1       -3
2       -2
3       -1

In [98]:
week_no['col_on'] = 1

In [99]:
week_no

   week_no  col_on
0       -4       1
1       -3       1
2       -2       1
3       -1       1

In [100]:
week_no.set_index('col_on',inplace =True)

In [101]:
week_no

        week_no
col_on
1            -4
1            -3
1            -2
1            -1

In [102]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [103]:
qs = sale_data.reset_index().groupby(['prod_id','size_id']).count()

In [104]:
qs

                 Year  qty
prod_id size_id
1101    12          2    2
1102    888         1    1
11022   888         1    1
1107    233         2    2
11071   21          1    1
2200    144         1    1
3300    277         1    1
44      177         1    1
66      2888        1    1
999     477         1    1

# drop

In [105]:
sale_data.drop(['Year'],axis=1)

                 qty
prod_id size_id
1101    12         8
        12        79
1107    233      863
        233       73
11071   21         1
1102    888        0
11022   888      756
2200    144        0
3300    277       64
999     477        7
44      177        8
66      2888       6

In [106]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [107]:
sale_data.reset_index().drop([4])

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [108]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [109]:
sale_copy = sale_data

# 删除列 drop

In [110]:
sale_data.drop(columns = ['qty'],axis = 1,inplace =True)

In [111]:
sale_data

                 Year
prod_id size_id
1101    12       2013
        12       2012
1107    233      2011
        233      2006
11071   21       2013
1102    888      2015
11022   888      2016
2200    144      2017
3300    277      2016
999     477      2014
44      177      2015
66      2888     2017


# rename_axis

In [112]:
sale_data.rename_axis(['A','b'])

            Year
A     b
1101  12    2013
      12    2012
1107  233   2011
      233   2006
11071 21    2013
1102  888   2015
11022 888   2016
2200  144   2017
3300  277   2016
999   477   2014
44    177   2015
66    2888  2017

In [113]:
sale_data.reset_index(inplace = True)

# sum(axis=1)

In [114]:
sale_data['sum'] = sale_data[['size_id','Year']].sum(axis=1)
sale_data

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

# datetime

In [115]:
import datetime as dt

In [116]:
date_dec = dt.datetime.now().date()

In [117]:
date_dec

datetime.date(2019, 4, 12)

In [118]:
date_cut = pd.to_datetime(date_dec - dt.timedelta(days= 7))

In [119]:
date_cut

Timestamp('2019-04-05 00:00:00')

In [280]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025   10
1     1101       12  2012  2024    1  2024   10
2     1107      233  2011  2244    1  2244   10
3     1107      233  2006  2239    1  2239   10
4    11071       21  2013  2034    1  2034   10
5     1102      888  2015  2903    1  2903   10
6    11022      888  2016  2904    1  2904   10
7     2200      144  2017  2161    1  2161   10
8     3300      277  2016  2293    1  2293   10
9      999      477  2014  2491    1  2491   10
10      44      177  2015  2192    1  2192   10
11      66     2888  2017  4905    1  4905   10

In [287]:
sale_data['date_sell'] = '2019-04-01'

In [289]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes   date_sell
0     1101       12  2013  2025    1  2025   10  2019-04-01
1     1101       12  2012  2024    1  2024   10  2019-04-01
2     1107      233  2011  2244    1  2244   10  2019-04-01
3     1107      233  2006  2239    1  2239   10  2019-04-01
4    11071       21  2013  2034    1  2034   10  2019-04-01
5     1102      888  2015  2903    1  2903   10  2019-04-01
6    11022      888  2016  2904    1  2904   10  2019-04-01
7     2200      144  2017  2161    1  2161   10  2019-04-01
8     3300      277  2016  2293    1  2293   10  2019-04-01
9      999      477  2014  2491    1  2491   10  2019-04-01
10      44      177  2015  2192    1  2192   10  2019-04-01
11      66     2888  2017  4905    1  4905   10  2019-04-01

In [290]:
sale_data['date_sell']= pd.to_datetime(sale_data['date_sell'])

In [291]:
sale_data['week_no'] = (sale_data['date_sell'] -
                         pd.to_datetime(date_dec)).dt.days//7

In [292]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes  date_sell  week_no
0     1101       12  2013  2025    1  2025   10 2019-04-01       -2
1     1101       12  2012  2024    1  2024   10 2019-04-01       -2
2     1107      233  2011  2244    1  2244   10 2019-04-01       -2
3     1107      233  2006  2239    1  2239   10 2019-04-01       -2
4    11071       21  2013  2034    1  2034   10 2019-04-01       -2
5     1102      888  2015  2903    1  2903   10 2019-04-01       -2
6    11022      888  2016  2904    1  2904   10 2019-04-01       -2
7     2200      144  2017  2161    1  2161   10 2019-04-01       -2
8     3300      277  2016  2293    1  2293   10 2019-04-01       -2
9      999      477  2014  2491    1  2491   10 2019-04-01       -2
10      44      177  2015  2192    1  2192   10 2019-04-01       -2
11      66     2888  2017  4905    1  4905   10 2019-04-01       -2

In [308]:
sale_data.loc[sale_data['we']>2000,['prod_id','sieze_id']].index

C:\Users\liuju\AppData\Local\Continuum\anaconda3\envs\python3.6\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [302]:
sale_data.index

RangeIndex(start=0, stop=12, step=1)

In [304]:
jaj = sale_data.reset_index(['prod_id','size_id']).groupby(['prod_id', 'size_id']).max()

KeyError: 'Level prod_id must be same as name (None)'

In [293]:
sale_data[sale_data['we']> 2200].index()

TypeError: 'Int64Index' object is not callable

# dateutil.relativedelta import relativedalta

In [120]:
from dateutil.relativedelta import relativedelta

In [121]:
lastday = (date_dec - relativedelta(days= 1)).strftime('%Y-%m-%d')

In [122]:
lastday

'2019-04-11'

In [123]:
lastmonth = (date_dec - relativedelta (months = 1)).strftime('%Y-%m-%d')

In [124]:
lastmonth

'2019-03-12'


# 时间间隔对象

In [125]:
testtime = dt.timedelta(days = 7)

In [126]:
testtime

datetime.timedelta(7)

In [127]:
kk3 = pd.to_datetime('2030-5-10')
kk3

Timestamp('2030-05-10 00:00:00')

In [128]:
kk3 > date_cut

True

In [129]:
df

          A         B         C         D     sumCD      test
a  0.000000 -0.749777 -2.220135  0.873028 -1.347107 -2.489282
b  0.000000  1.101578 -1.319402  0.000000 -1.319402 -2.489282
c  0.000000  1.783364  0.310299  3.780791  4.091090 -2.489282
d -2.432695 -1.063328  0.334875  0.000000  0.334875 -2.489282
e  0.000000  0.642187 -0.106787  0.641710  0.534923 -2.489282
f  0.000000  0.311568 -0.271225  0.000000 -0.271225 -2.489282
g -0.056587  0.542339 -0.906059  0.000000 -0.906059 -2.489282
z  0.000000  0.594717 -0.755441  3.213434  2.457994 -2.489282

In [130]:
sale_copy

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [131]:
sale_copy.set_index(['prod_id','size_id']).groupby(['prod_id','size_id']).sum()

                 Year   sum
prod_id size_id
1101    12       4025  4049
1102    888      2015  2903
11022   888      2016  2904
1107    233      4017  4483
11071   21       2013  2034
2200    144      2017  2161
3300    277      2016  2293
44      177      2015  2192
66      2888     2017  4905
999     477      2014  2491

In [132]:
sale_copy

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [133]:
sale_copy.index.drop_duplicates()

RangeIndex(start=0, stop=12, step=1)

In [134]:
# sale_copy['size_id'].max(level = [])

In [135]:
sale_copy

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [136]:
sale_copy['col']=1

In [137]:
sale_copy_1 = sale_copy

In [138]:
# p1 = sale_copy_1.reset_index('col', inplace = True)
# p1

In [140]:
# p = sale_copy.reset_index('col', inplace = True)
# p

In [141]:
p1.join(p)

NameError: name 'p1' is not defined

In [142]:
sale_copy

   prod_id  size_id  Year   sum  col
0     1101       12  2013  2025    1
1     1101       12  2012  2024    1
2     1107      233  2011  2244    1
3     1107      233  2006  2239    1
4    11071       21  2013  2034    1
5     1102      888  2015  2903    1
6    11022      888  2016  2904    1
7     2200      144  2017  2161    1
8     3300      277  2016  2293    1
9      999      477  2014  2491    1
10      44      177  2015  2192    1
11      66     2888  2017  4905    1

In [143]:
import numpy as np
sale_copy['we'] = sale_copy['sum'].map(lambda x: 1/(  1 + np.exp(-10 * (x+1))))

In [144]:
sale_copy

   prod_id  size_id  Year   sum  col   we
0     1101       12  2013  2025    1  1.0
1     1101       12  2012  2024    1  1.0
2     1107      233  2011  2244    1  1.0
3     1107      233  2006  2239    1  1.0
4    11071       21  2013  2034    1  1.0
5     1102      888  2015  2903    1  1.0
6    11022      888  2016  2904    1  1.0
7     2200      144  2017  2161    1  1.0
8     3300      277  2016  2293    1  1.0
9      999      477  2014  2491    1  1.0
10      44      177  2015  2192    1  1.0
11      66     2888  2017  4905    1  1.0

In [145]:
x =lambda x: 1/(1 + np.exp(-10 * (x+1)))

In [146]:
x

In [147]:
sale_data

   prod_id  size_id  Year   sum  col   we
0     1101       12  2013  2025    1  1.0
1     1101       12  2012  2024    1  1.0
2     1107      233  2011  2244    1  1.0
3     1107      233  2006  2239    1  1.0
4    11071       21  2013  2034    1  1.0
5     1102      888  2015  2903    1  1.0
6    11022      888  2016  2904    1  1.0
7     2200      144  2017  2161    1  1.0
8     3300      277  2016  2293    1  1.0
9      999      477  2014  2491    1  1.0
10      44      177  2015  2192    1  1.0
11      66     2888  2017  4905    1  1.0

# prod 返回请求轴的乘积

In [148]:
sale_data[['sum','we']].prod(axis=1)

0     2025.0
1     2024.0
2     2244.0
3     2239.0
4     2034.0
5     2903.0
6     2904.0
7     2161.0
8     2293.0
9     2491.0
10    2192.0
11    4905.0
dtype: float64

In [149]:
#copy

In [150]:
sale_data

   prod_id  size_id  Year   sum  col   we
0     1101       12  2013  2025    1  1.0
1     1101       12  2012  2024    1  1.0
2     1107      233  2011  2244    1  1.0
3     1107      233  2006  2239    1  1.0
4    11071       21  2013  2034    1  1.0
5     1102      888  2015  2903    1  1.0
6    11022      888  2016  2904    1  1.0
7     2200      144  2017  2161    1  1.0
8     3300      277  2016  2293    1  1.0
9      999      477  2014  2491    1  1.0
10      44      177  2015  2192    1  1.0
11      66     2888  2017  4905    1  1.0

In [151]:
sale_pp = sale_data.loc[sale_data['Year'] == 2013, ['prod_id','size_id']].copy()

In [152]:
sale_pp

  prod_id  size_id
0    1101       12
4   11071       21

In [153]:
cols_grp2 = ['prod_id', 'color_id', 'mng_reg_id', 'size']

In [154]:
cols_grp2[2]

'mng_reg_id'

In [155]:
sale_data

   prod_id  size_id  Year   sum  col   we
0     1101       12  2013  2025    1  1.0
1     1101       12  2012  2024    1  1.0
2     1107      233  2011  2244    1  1.0
3     1107      233  2006  2239    1  1.0
4    11071       21  2013  2034    1  1.0
5     1102      888  2015  2903    1  1.0
6    11022      888  2016  2904    1  1.0
7     2200      144  2017  2161    1  1.0
8     3300      277  2016  2293    1  1.0
9      999      477  2014  2491    1  1.0
10      44      177  2015  2192    1  1.0
11      66     2888  2017  4905    1  1.0

In [156]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [157]:
sale_data

                 Year   sum  col   we
prod_id size_id
1101    12       2013  2025    1  1.0
        12       2012  2024    1  1.0
1107    233      2011  2244    1  1.0
        233      2006  2239    1  1.0
11071   21       2013  2034    1  1.0
1102    888      2015  2903    1  1.0
11022   888      2016  2904    1  1.0
2200    144      2017  2161    1  1.0
3300    277      2016  2293    1  1.0
999     477      2014  2491    1  1.0
44      177      2015  2192    1  1.0
66      2888     2017  4905    1  1.0

In [158]:
sale_data['sum'].max(level = ['prod_id','size_id'])

prod_id  size_id
1101     12         2025
1107     233        2244
11071    21         2034
1102     888        2903
11022    888        2904
2200     144        2161
3300     277        2293
999      477        2491
44       177        2192
66       2888       4905
Name: sum, dtype: int64

In [159]:
sale_data['sum'].max()

4905

In [160]:
sale_data

                 Year   sum  col   we
prod_id size_id
1101    12       2013  2025    1  1.0
        12       2012  2024    1  1.0
1107    233      2011  2244    1  1.0
        233      2006  2239    1  1.0
11071   21       2013  2034    1  1.0
1102    888      2015  2903    1  1.0
11022   888      2016  2904    1  1.0
2200    144      2017  2161    1  1.0
3300    277      2016  2293    1  1.0
999     477      2014  2491    1  1.0
44      177      2015  2192    1  1.0
66      2888     2017  4905    1  1.0

In [161]:
sale_data['sum'].mean(level = ['prod_id','size_id'])

prod_id  size_id
1101     12         2024.5
1107     233        2241.5
11071    21         2034.0
1102     888        2903.0
11022    888        2904.0
2200     144        2161.0
3300     277        2293.0
999      477        2491.0
44       177        2192.0
66       2888       4905.0
Name: sum, dtype: float64

In [162]:
sale_data[['col','sum']].prod(axis =1)

prod_id  size_id
1101     12         2025
         12         2024
1107     233        2244
         233        2239
11071    21         2034
1102     888        2903
11022    888        2904
2200     144        2161
3300     277        2293
999      477        2491
44       177        2192
66       2888       4905
dtype: int64

In [163]:
sale_data

                 Year   sum  col   we
prod_id size_id
1101    12       2013  2025    1  1.0
        12       2012  2024    1  1.0
1107    233      2011  2244    1  1.0
        233      2006  2239    1  1.0
11071   21       2013  2034    1  1.0
1102    888      2015  2903    1  1.0
11022   888      2016  2904    1  1.0
2200    144      2017  2161    1  1.0
3300    277      2016  2293    1  1.0
999     477      2014  2491    1  1.0
44      177      2015  2192    1  1.0
66      2888     2017  4905    1  1.0

In [164]:
sale_data['col'].reset_index(['prod_id','size_id'])

   prod_id  size_id  col
0     1101       12    1
1     1101       12    1
2     1107      233    1
3     1107      233    1
4    11071       21    1
5     1102      888    1
6    11022      888    1
7     2200      144    1
8     3300      277    1
9      999      477    1
10      44      177    1
11      66     2888    1

In [165]:
sale_data

                 Year   sum  col   we
prod_id size_id
1101    12       2013  2025    1  1.0
        12       2012  2024    1  1.0
1107    233      2011  2244    1  1.0
        233      2006  2239    1  1.0
11071   21       2013  2034    1  1.0
1102    888      2015  2903    1  1.0
11022   888      2016  2904    1  1.0
2200    144      2017  2161    1  1.0
3300    277      2016  2293    1  1.0
999     477      2014  2491    1  1.0
44      177      2015  2192    1  1.0
66      2888     2017  4905    1  1.0

In [166]:
sale_data['yes'] = sale_data[['col','we']].sum(axis=1)

In [167]:
sale_data

                 Year   sum  col   we  yes
prod_id size_id
1101    12       2013  2025    1  1.0  2.0
        12       2012  2024    1  1.0  2.0
1107    233      2011  2244    1  1.0  2.0
        233      2006  2239    1  1.0  2.0
11071   21       2013  2034    1  1.0  2.0
1102    888      2015  2903    1  1.0  2.0
11022   888      2016  2904    1  1.0  2.0
2200    144      2017  2161    1  1.0  2.0
3300    277      2016  2293    1  1.0  2.0
999     477      2014  2491    1  1.0  2.0
44      177      2015  2192    1  1.0  2.0
66      2888     2017  4905    1  1.0  2.0

In [168]:
sale_data.loc[sale_data['sum']>sale_data['col'], 'we'] =  sale_data.loc[sale_data['sum']>sale_data['col'],'sum']

C:\Users\liuju\AppData\Local\Continuum\anaconda3\envs\python3.6\lib\site-packages\IPython\core\interactiveshell.py:2848: PerformanceWarning: indexing past lexsort depth may impact performance.
  raw_cell, store_history, silent, shell_futures)

In [169]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

# multiprocessing

In [170]:
import multiprocessing
from multiprocessing import Pool, cpu_count

In [171]:
cpu_count()

6

# map(func, iterable[, chunksize=None])
# Pool类中的map方法，与内置的map函数用法行为基本一致，它会使进程阻塞直到返回结果。 
# 注意，虽然第二个参数是一个迭代器，但在实际使用中，必须在整个队列都就绪后，程序才会运行子进程。

In [172]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

In [173]:
sale_data.index.get_level_values(level = 'size_id')

Int64Index([12, 12, 233, 233, 21, 888, 888, 144, 277, 477, 177, 2888], dtype='int64', name='size_id')

# get_level_values uique()

In [174]:
sale_data.index.get_level_values(level = 'size_id').unique()

Int64Index([12, 233, 21, 888, 144, 277, 477, 177, 2888], dtype='int64', name='size_id')

In [175]:
gg = sale_data.index.get_level_values(level = 'size_id').unique()

In [176]:
gg

Int64Index([12, 233, 21, 888, 144, 277, 477, 177, 2888], dtype='int64', name='size_id')

In [177]:
gg.shape[0]

9

In [178]:
import math
skc_num_sum = 30
skc_num_grp = 30
range(math.ceil(skc_num_sum / skc_num_grp))

range(0, 1)

# at

In [179]:
sale_data.reset_index().at[0,'we']

2025

In [180]:
sale_data.reset_index(inplace = True)

In [181]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [182]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

In [183]:
# sale_data.at[('2200','144'), 'we']

In [184]:
cols_mov = ['prod_id', 'color_id', 'size', 'org_send_id', 'org_rec_id']

    # Moving records
q = pd.DataFrame(columns=cols_mov + ['quant_mov']).set_index(cols_mov)

In [185]:
q

Empty DataFrame
Columns: [quant_mov]
Index: []

In [186]:
cols_stc = ['prod_id', 'color_id', 'size', 'org_id']

In [187]:
cols_stc[-2]

'size'

In [188]:
sale_data.reset_index()

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025  2.0
1     1101       12  2012  2024    1  2024  2.0
2     1107      233  2011  2244    1  2244  2.0
3     1107      233  2006  2239    1  2239  2.0
4    11071       21  2013  2034    1  2034  2.0
5     1102      888  2015  2903    1  2903  2.0
6    11022      888  2016  2904    1  2904  2.0
7     2200      144  2017  2161    1  2161  2.0
8     3300      277  2016  2293    1  2293  2.0
9      999      477  2014  2491    1  2491  2.0
10      44      177  2015  2192    1  2192  2.0
11      66     2888  2017  4905    1  4905  2.0

In [189]:
test0 = sale_data.index.get_level_values('size_id').unique()

In [190]:
mub=test0.shape[0]

In [191]:
mub

9

In [192]:
grap = 3

# 分组 math.ceil

In [193]:
for i in range (math.ceil(mub/grap)):
    print(i)

0
1
2

In [194]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

# dict sum( .values())

In [195]:
dict1 = {'a': 10, 'b': 2, 'c': 3}

In [196]:
dict1

{'a': 10, 'b': 2, 'c': 3}

In [197]:
sum(dict1.values())

15

In [198]:
pp = pd.DataFrame(dict1, index = ['haha'])

In [199]:
pp

       a  b  c
haha  10  2  3

In [200]:
pp.T.rename_axis('qt')

    haha
qt
a     10
b      2
c      3

In [201]:
dict2 = {('pro','size'):'10',('pro1','size1'):90}

In [202]:
dict2

{('pro', 'size'): '10', ('pro1', 'size1'): 90}

# dict key 有多个值

In [203]:
dict2[('pro','size')]

'10'

In [204]:
dict2[('pro1','size1')]

90

In [205]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

In [206]:
sale_copy = sale_data.copy().rename(columns={'col':'he'})

In [207]:
sale_copy

                 Year   sum  he    we  yes
prod_id size_id
1101    12       2013  2025   1  2025  2.0
        12       2012  2024   1  2024  2.0
1107    233      2011  2244   1  2244  2.0
        233      2006  2239   1  2239  2.0
11071   21       2013  2034   1  2034  2.0
1102    888      2015  2903   1  2903  2.0
11022   888      2016  2904   1  2904  2.0
2200    144      2017  2161   1  2161  2.0
3300    277      2016  2293   1  2293  2.0
999     477      2014  2491   1  2491  2.0
44      177      2015  2192   1  2192  2.0
66      2888     2017  4905   1  4905  2.0

In [208]:
sale_copy.join(sale_data, how = 'outer',rsuffix = '_add')

                 Year   sum  he    we  yes  Year_add  sum_add  col  we_add  \
prod_id size_id
1101    12       2013  2025   1  2025  2.0      2013     2025    1    2025
        12       2013  2025   1  2025  2.0      2012     2024    1    2024
        12       2012  2024   1  2024  2.0      2013     2025    1    2025
        12       2012  2024   1  2024  2.0      2012     2024    1    2024
1102    888      2015  2903   1  2903  2.0      2015     2903    1    2903
11022   888      2016  2904   1  2904  2.0      2016     2904    1    2904
1107    233      2011  2244   1  2244  2.0      2011     2244    1    2244
        233      2011  2244   1  2244  2.0      2006     2239    1    2239
        233      2006  2239   1  2239  2.0      2011     2244    1    2244
        233      2006  2239   1  2239  2.0      2006     2239    1    2239
11071   21       2013  2034   1  2034  2.0      2013     2034    1    2034
2200    144      2017  2161   1  2161  2.0      2017     2161    1    2161
3300    277      2016  2293   1  2293  2.0      2016     2293    1    2293
44      177      2015  2192   1  2192  2.0      2015     2192    1    2192
66      2888     2017  4905   1  4905  2.0      2017     4905    1    4905
999     477      2014  2491   1  2491  2.0      2014     2491    1    2491

                 yes_add
prod_id size_id
1101    12           2.0
        12           2.0
        12           2.0
        12           2.0
1102    888          2.0
11022   888          2.0
1107    233          2.0
        233          2.0
        233          2.0
        233          2.0
11071   21           2.0
2200    144          2.0
3300    277          2.0
44      177          2.0
66      2888         2.0
999     477          2.0

In [209]:
sale_data

                 Year   sum  col    we  yes
prod_id size_id
1101    12       2013  2025    1  2025  2.0
        12       2012  2024    1  2024  2.0
1107    233      2011  2244    1  2244  2.0
        233      2006  2239    1  2239  2.0
11071   21       2013  2034    1  2034  2.0
1102    888      2015  2903    1  2903  2.0
11022   888      2016  2904    1  2904  2.0
2200    144      2017  2161    1  2161  2.0
3300    277      2016  2293    1  2293  2.0
999     477      2014  2491    1  2491  2.0
44      177      2015  2192    1  2192  2.0
66      2888     2017  4905    1  4905  2.0

In [210]:
# sale_data.set_index(['prod_id','size_id'])
sale_data.reset_index(inplace = True)

In [211]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025  2.0
1     1101       12  2012  2024    1  2024  2.0
2     1107      233  2011  2244    1  2244  2.0
3     1107      233  2006  2239    1  2239  2.0
4    11071       21  2013  2034    1  2034  2.0
5     1102      888  2015  2903    1  2903  2.0
6    11022      888  2016  2904    1  2904  2.0
7     2200      144  2017  2161    1  2161  2.0
8     3300      277  2016  2293    1  2293  2.0
9      999      477  2014  2491    1  2491  2.0
10      44      177  2015  2192    1  2192  2.0
11      66     2888  2017  4905    1  4905  2.0

In [212]:
ca = (sale_data['size_id'] ==144) & (sale_data['sum'] ==2161)

In [213]:
ca

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
dtype: bool

In [214]:
sale_data.loc[ca,['col','sum']]

   col   sum
7    1  2161

In [215]:
sale_data['yes'] = 10

In [216]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025   10
1     1101       12  2012  2024    1  2024   10
2     1107      233  2011  2244    1  2244   10
3     1107      233  2006  2239    1  2239   10
4    11071       21  2013  2034    1  2034   10
5     1102      888  2015  2903    1  2903   10
6    11022      888  2016  2904    1  2904   10
7     2200      144  2017  2161    1  2161   10
8     3300      277  2016  2293    1  2293   10
9      999      477  2014  2491    1  2491   10
10      44      177  2015  2192    1  2192   10
11      66     2888  2017  4905    1  4905   10

In [217]:
sale_data[(sale_data['we']==4905)]

   prod_id  size_id  Year   sum  col    we  yes
11      66     2888  2017  4905    1  4905   10

In [218]:
sale_data[(sale_data['we']==4905)].index.unique()

Int64Index([11], dtype='int64')

# 创建多层列索引 pd.MultiIndex.from_product

In [219]:
coll = pd.MultiIndex.from_product([['期中','期末'],names = ['语文','数学']])

SyntaxError: invalid syntax (<ipython-input-219-f0de93a04a4d>, line 1)

In [220]:
coll

NameError: name 'coll' is not defined

In [221]:
df = pd.DataFrame(data = np.random.randint(2,8, size = (2,4)),
          index = ['yom','kou'],
          columns = coll)

NameError: name 'coll' is not defined

In [222]:
df

          A         B         C         D     sumCD      test
a  0.000000 -0.749777 -2.220135  0.873028 -1.347107 -2.489282
b  0.000000  1.101578 -1.319402  0.000000 -1.319402 -2.489282
c  0.000000  1.783364  0.310299  3.780791  4.091090 -2.489282
d -2.432695 -1.063328  0.334875  0.000000  0.334875 -2.489282
e  0.000000  0.642187 -0.106787  0.641710  0.534923 -2.489282
f  0.000000  0.311568 -0.271225  0.000000 -0.271225 -2.489282
g -0.056587  0.542339 -0.906059  0.000000 -0.906059 -2.489282
z  0.000000  0.594717 -0.755441  3.213434  2.457994 -2.489282

In [223]:
df['期中']

KeyError: '期中'

In [224]:
df['期末']

KeyError: '期末'

In [225]:
data= [1,2,3]

In [226]:
a= pd.DataFrame(data)

In [227]:
a

   0
0  1
1  2
2  3

In [228]:
max (11, 0)

11

In [229]:
max(-1, 0)

0

# sign

In [230]:
datalist = [-1, 10, 90, -88, 92, 3, 0, 19, 0]

In [231]:
np.sign(datalist)

array([-1,  1,  1, -1,  1,  1,  0,  1,  0])

In [232]:
from dateutil.relativedelta import relativedelta
date + =relativedelta(months=1)

SyntaxError: invalid syntax (<ipython-input-232-4dfe60fc9650>, line 2)

In [233]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025   10
1     1101       12  2012  2024    1  2024   10
2     1107      233  2011  2244    1  2244   10
3     1107      233  2006  2239    1  2239   10
4    11071       21  2013  2034    1  2034   10
5     1102      888  2015  2903    1  2903   10
6    11022      888  2016  2904    1  2904   10
7     2200      144  2017  2161    1  2161   10
8     3300      277  2016  2293    1  2293   10
9      999      477  2014  2491    1  2491   10
10      44      177  2015  2192    1  2192   10
11      66     2888  2017  4905    1  4905   10

In [234]:
sale_data.drop_duplicates(['prod_id','size_id'])

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025   10
2     1107      233  2011  2244    1  2244   10
4    11071       21  2013  2034    1  2034   10
5     1102      888  2015  2903    1  2903   10
6    11022      888  2016  2904    1  2904   10
7     2200      144  2017  2161    1  2161   10
8     3300      277  2016  2293    1  2293   10
9      999      477  2014  2491    1  2491   10
10      44      177  2015  2192    1  2192   10
11      66     2888  2017  4905    1  4905   10

# DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)
    subset : column label or sequence of labels, optional 
        用来指定特定的列，默认所有列
    keep : {‘first’, ‘last’, False}, default ‘first’ 
        删除重复项并保留第一次出现的项
    inplace : boolean, default False 
        是直接在原来数据上修改还是保留一个副本

In [235]:
list1 = [0.1, 21, 232.890]

In [236]:
list1

[0.1, 21, 232.89]

In [237]:
type(list1)

list

In [238]:
list2 = np.array(list1)

In [239]:
list2

array([1.0000e-01, 2.1000e+01, 2.3289e+02])

In [240]:
type(list2)

numpy.ndarray

In [241]:
list3 = list2.astype('int')

In [242]:
list3

array([  0,  21, 232])

# astype

In [243]:
list4 = list2.astype('float')

In [244]:
list4

array([1.0000e-01, 2.1000e+01, 2.3289e+02])

In [245]:
# list5 = list1.astype('int')

In [246]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes
0     1101       12  2013  2025    1  2025   10
1     1101       12  2012  2024    1  2024   10
2     1107      233  2011  2244    1  2244   10
3     1107      233  2006  2239    1  2239   10
4    11071       21  2013  2034    1  2034   10
5     1102      888  2015  2903    1  2903   10
6    11022      888  2016  2904    1  2904   10
7     2200      144  2017  2161    1  2161   10
8     3300      277  2016  2293    1  2293   10
9      999      477  2014  2491    1  2491   10
10      44      177  2015  2192    1  2192   10
11      66     2888  2017  4905    1  4905   10

In [268]:
sale_copy

                 Year   sum  he    we  yes
prod_id size_id
1101    12       2013  2025   1  2025  2.0
        12       2012  2024   1  2024  2.0
1107    233      2011  2244   1  2244  2.0
        233      2006  2239   1  2239  2.0
11071   21       2013  2034   1  2034  2.0
1102    888      2015  2903   1  2903  2.0
11022   888      2016  2904   1  2904  2.0
2200    144      2017  2161   1  2161  2.0
3300    277      2016  2293   1  2293  2.0
999     477      2014  2491   1  2491  2.0
44      177      2015  2192   1  2192  2.0
66      2888     2017  4905   1  4905  2.0

In [274]:
sale_copy.drop([66])

TypeError: object of type 'int' has no len()

In [267]:
sale_data.index()

TypeError: 'RangeIndex' object is not callable

In [262]:
haha  = sale_copy[sale_copy['we']==4905]

In [263]:
haha

                 Year   sum  he    we  yes
prod_id size_id
66      2888     2017  4905   1  4905  2.0

In [277]:
haha.reset_index(inplace =  True)

In [278]:
haha

  prod_id  size_id  Year   sum  he    we  yes
0      66     2888  2017  4905   1  4905  2.0

In [279]:
haha.drop([0])

Empty DataFrame
Columns: [prod_id, size_id, Year, sum, he, we, yes]
Index: []

In [309]:
sale_data

   prod_id  size_id  Year   sum  col    we  yes  date_sell  week_no
0     1101       12  2013  2025    1  2025   10 2019-04-01       -2
1     1101       12  2012  2024    1  2024   10 2019-04-01       -2
2     1107      233  2011  2244    1  2244   10 2019-04-01       -2
3     1107      233  2006  2239    1  2239   10 2019-04-01       -2
4    11071       21  2013  2034    1  2034   10 2019-04-01       -2
5     1102      888  2015  2903    1  2903   10 2019-04-01       -2
6    11022      888  2016  2904    1  2904   10 2019-04-01       -2
7     2200      144  2017  2161    1  2161   10 2019-04-01       -2
8     3300      277  2016  2293    1  2293   10 2019-04-01       -2
9      999      477  2014  2491    1  2491   10 2019-04-01       -2
10      44      177  2015  2192    1  2192   10 2019-04-01       -2
11      66     2888  2017  4905    1  4905   10 2019-04-01       -2

In [313]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [314]:
sale_data

                 Year   sum  col    we  yes  date_sell  week_no
prod_id size_id
1101    12       2013  2025    1  2025   10 2019-04-01       -2
        12       2012  2024    1  2024   10 2019-04-01       -2
1107    233      2011  2244    1  2244   10 2019-04-01       -2
        233      2006  2239    1  2239   10 2019-04-01       -2
11071   21       2013  2034    1  2034   10 2019-04-01       -2
1102    888      2015  2903    1  2903   10 2019-04-01       -2
11022   888      2016  2904    1  2904   10 2019-04-01       -2
2200    144      2017  2161    1  2161   10 2019-04-01       -2
3300    277      2016  2293    1  2293   10 2019-04-01       -2
999     477      2014  2491    1  2491   10 2019-04-01       -2
44      177      2015  2192    1  2192   10 2019-04-01       -2
66      2888     2017  4905    1  4905   10 2019-04-01       -2

In [319]:
mm = sale_data.loc[sale_data['we']>2400].index

In [320]:
mm

MultiIndex(levels=[['1101', '1102', '11022', '1107', '11071', '2200', '3300', '44', '66', '999'], [12, 21, 144, 177, 233, 277, 477, 888, 2888]],
           codes=[[1, 2, 9, 8], [7, 7, 6, 8]],
           names=['prod_id', 'size_id'])

In [322]:
sale_data.reset_index(inplace = True)

In [324]:
sale_copy.reset_index(inplace = True)

In [327]:
org = sale_data.append(sale_copy,sort = False)

In [328]:
org

   prod_id  size_id  Year   sum  col    we   yes  date_sell  week_no   he
0     1101       12  2013  2025  1.0  2025  10.0 2019-04-01     -2.0  NaN
1     1101       12  2012  2024  1.0  2024  10.0 2019-04-01     -2.0  NaN
2     1107      233  2011  2244  1.0  2244  10.0 2019-04-01     -2.0  NaN
3     1107      233  2006  2239  1.0  2239  10.0 2019-04-01     -2.0  NaN
4    11071       21  2013  2034  1.0  2034  10.0 2019-04-01     -2.0  NaN
5     1102      888  2015  2903  1.0  2903  10.0 2019-04-01     -2.0  NaN
6    11022      888  2016  2904  1.0  2904  10.0 2019-04-01     -2.0  NaN
7     2200      144  2017  2161  1.0  2161  10.0 2019-04-01     -2.0  NaN
8     3300      277  2016  2293  1.0  2293  10.0 2019-04-01     -2.0  NaN
9      999      477  2014  2491  1.0  2491  10.0 2019-04-01     -2.0  NaN
10      44      177  2015  2192  1.0  2192  10.0 2019-04-01     -2.0  NaN
11      66     2888  2017  4905  1.0  4905  10.0 2019-04-01     -2.0  NaN
0     1101       12  2013  2025  NaN  2025   2.0        NaT      NaN  1.0
1     1101       12  2012  2024  NaN  2024   2.0        NaT      NaN  1.0
2     1107      233  2011  2244  NaN  2244   2.0        NaT      NaN  1.0
3     1107      233  2006  2239  NaN  2239   2.0        NaT      NaN  1.0
4    11071       21  2013  2034  NaN  2034   2.0        NaT      NaN  1.0
5     1102      888  2015  2903  NaN  2903   2.0        NaT      NaN  1.0
6    11022      888  2016  2904  NaN  2904   2.0        NaT      NaN  1.0
7     2200      144  2017  2161  NaN  2161   2.0        NaT      NaN  1.0
8     3300      277  2016  2293  NaN  2293   2.0        NaT      NaN  1.0
9      999      477  2014  2491  NaN  2491   2.0        NaT      NaN  1.0
10      44      177  2015  2192  NaN  2192   2.0        NaT      NaN  1.0
11      66     2888  2017  4905  NaN  4905   2.0        NaT      NaN  1.0

In [329]:
org['col_on'] =1

In [330]:
org

,prod_id,size_id,Year,sum,col,we,yes,date_sell,week_no,he,col_on
0,1101,12,2013,2025,1.0,2025,10.0,2019-04-01,-2.0,NaN,1
1,1101,12,2012,2024,1.0,2024,10.0,2019-04-01,-2.0,NaN,1
2,1107,233,2011,2244,1.0,2244,10.0,2019-04-01,-2.0,NaN,1
3,1107,233,2006,2239,1.0,2239,10.0,2019-04-01,-2.0,NaN,1
4,11071,21,2013,2034,1.0,2034,10.0,2019-04-01,-2.0,NaN,1
5,1102,888,2015,2903,1.0,2903,10.0,2019-04-01,-2.0,NaN,1
6,11022,888,2016,2904,1.0,2904,10.0,2019-04-01,-2.0,NaN,1
7,2200,144,2017,2161,1.0,2161,10.0,2019-04-01,-2.0,NaN,1
8,3300,277,2016,2293,1.0,2293,10.0,2019-04-01,-2.0,NaN,1
9,999,477,2014,2491,1.0,2491,10.0,2019-04-01,-2.0,NaN,1
10,44,177,2015,2192,1.0,2192,10.0,2019-04-01,-2.0,NaN,1
11,66,2888,2017,4905,1.0,4905,10.0,2019-04-01,-2.0,NaN,1
0,1101,12,2013,2025,NaN,2025,2.0,NaT,NaN,1.0,1
1,1101,12,2012,2024,NaN,2024,2.0,NaT,NaN,1.0,1
2,1107,233,2011,2244,NaN,2244,2.0,NaT,NaN,1.0,1
3,1107,233,2006,2239,NaN,2239,2.0,NaT,NaN,1.0,1
4,11071,21,2013,2034,NaN,2034,2.0,NaT,NaN,1.0,1
5,1102,888,2015,2903,NaN,2903,2.0,NaT,NaN,1.0,1
6,11022,888,2016,2904,NaN,2904,2.0,NaT,NaN,1.0,1
7,2200,144,2017,2161,NaN,2161,2.0,NaT,NaN,1.0,1
8,3300,277,2016,2293,NaN,2293,2.0,NaT,NaN,1.0,1
9,999,477,2014,2491,NaN,2491,2.0,NaT,NaN,1.0,1
10,44,177,2015,2192,NaN,2192,2.0,NaT,NaN,1.0,1
11,66,2888,2017,4905,NaN,4905,2.0,NaT,NaN,1.0,1

In [331]:
org.set_index('col_on',inplace = True)

In [332]:
org

       prod_id  size_id  Year   sum  col    we   yes  date_sell  week_no   he
col_on
1         1101       12  2013  2025  1.0  2025  10.0 2019-04-01     -2.0  NaN
1         1101       12  2012  2024  1.0  2024  10.0 2019-04-01     -2.0  NaN
1         1107      233  2011  2244  1.0  2244  10.0 2019-04-01     -2.0  NaN
1         1107      233  2006  2239  1.0  2239  10.0 2019-04-01     -2.0  NaN
1        11071       21  2013  2034  1.0  2034  10.0 2019-04-01     -2.0  NaN
1         1102      888  2015  2903  1.0  2903  10.0 2019-04-01     -2.0  NaN
1        11022      888  2016  2904  1.0  2904  10.0 2019-04-01     -2.0  NaN
1         2200      144  2017  2161  1.0  2161  10.0 2019-04-01     -2.0  NaN
1         3300      277  2016  2293  1.0  2293  10.0 2019-04-01     -2.0  NaN
1          999      477  2014  2491  1.0  2491  10.0 2019-04-01     -2.0  NaN
1           44      177  2015  2192  1.0  2192  10.0 2019-04-01     -2.0  NaN
1           66     2888  2017  4905  1.0  4905  10.0 2019-04-01     -2.0  NaN
1         1101       12  2013  2025  NaN  2025   2.0        NaT      NaN  1.0
1         1101       12  2012  2024  NaN  2024   2.0        NaT      NaN  1.0
1         1107      233  2011  2244  NaN  2244   2.0        NaT      NaN  1.0
1         1107      233  2006  2239  NaN  2239   2.0        NaT      NaN  1.0
1        11071       21  2013  2034  NaN  2034   2.0        NaT      NaN  1.0
1         1102      888  2015  2903  NaN  2903   2.0        NaT      NaN  1.0
1        11022      888  2016  2904  NaN  2904   2.0        NaT      NaN  1.0
1         2200      144  2017  2161  NaN  2161   2.0        NaT      NaN  1.0
1         3300      277  2016  2293  NaN  2293   2.0        NaT      NaN  1.0
1          999      477  2014  2491  NaN  2491   2.0        NaT      NaN  1.0
1           44      177  2015  2192  NaN  2192   2.0        NaT      NaN  1.0
1           66     2888  2017  4905  NaN  4905   2.0        NaT      NaN  1.0